final-project-resources/run-grid-coarse-KVLCC2-SA-stampede2/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\ 
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialName air;

transportModel Newtonian;

nu nu [0 2 -1 0 0 0 0 ] 0.000015;

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
